# SQL Reference A-Z

In [19]:
from IPython.display import HTML
HTML("<style>table{width:100%;table-layout:fixed}td,th{white-space:normal;overflow-wrap:anywhere;vertical-align:top}table th:nth-child(1),table td:nth-child(1){width:15%}table th:nth-child(2),table td:nth-child(2){width:25%}table th:nth-child(3),table td:nth-child(3){width:30%}table th:nth-child(4),table td:nth-child(4){width:30%}</style>")

## Logical Operators
| Operator | Definition | Syntax | Example |
|--------|------------|--------|----------------|
| AND | The AND operator allows the existence of multiple conditions in an SQL statement's WHERE clause. | SELECT col1<br>FROM table<br>WHERE col1=VALUE AND col2=VALUE | SELECT *<br>FROM Contact<br>WHERE LastName = 'Adams' AND FirstName = 'Mary' |
| OR | The OR operator is used to combine multiple conditions in an SQL statement's WHERE clause. | SELECT col1<br>FROM table<br>WHERE col1=VALUE OR col2=VALUE | SELECT *<br>FROM Contact<br>WHERE LastName = 'Adams' OR FirstName = 'Mary' |
| AND / OR (Parentheses) | Example of using both AND and OR in a WHERE clause, with parentheses | -- | SELECT * <br>FROM Contact<br>WHERE LastName = 'Adams' AND (FirstName='Carla' OR FirstName='Mary') |
| BETWEEN | The BETWEEN operator selects a range of data between two values (a minimum and maximum). The values can be numbers, text, or dates. | SELECT colname<br>FROM table<br>WHERE colname BETWEEN value1 AND value2 | SELECT *<br>FROM BillOfMaterials<br>WHERE PerAssemblyQty BETWEEN 2 AND 4 |
| IN | The IN operator is used to compare a value to a list of literal values that have been specified. | SELECT colname<br>FROM table<br>WHERE colname IN (value1, value2) | SELECT *<br>FROM Contact<br>WHERE LastName IN ('Abel','Smith') |
| NOT | The NOT operator reverses the meaning of the logical operator with which it is used. Eg: NOT EXISTS, NOT BETWEEN, NOT IN, etc. This is a negate operator. | SELECT colname<br>FROM table<br>WHERE colname NOT IN (value1, value2) | SELECT ProductID, VendorID, StandardPrice<br>FROM ProductVendor<br>WHERE ProductID NOT IN (317, 318)* |
| IS NULL | The NULL operator is used to compare a value with a NULL value. | -- | SELECT *<br>FROM table<br>WHERE column IS NULL; |
| LIKE | LIKE (is technically not an operator, but a predicate) is used to compare a value to similar values using wildcard operators (i.e., LIKE is used to search for a specified pattern in a column). | SELECT colname<br>FROM table<br>WHERE colname LIKE [pattern] | SELECT colname<br>FROM table<br>WHERE colname LIKE 'A%'; |

## Wildcard Operators
| Operator | Definition | Syntax | Example |
|--------|------------|--------|----------------|
| % Percent sign | Matches one or more characters | see below | |
| LIKE 'J%' | String begins with 'J' | SELECT * <br> FROM Contact<br> WHERE LastName LIKE 'J%' | SELECT *<br> FROM Product<br> WHERE Name LIKE 'ML Touring%' |
| LIKE '%J' | String ends with 'J' | SELECT * <br> FROM Contact<br> WHERE LastName LIKE '%J' | SELECT *<br> FROM Product<br> WHERE Name LIKE '%Crankarm' |
| LIKE 'mail.%.com' | String begins with 'mail.' and ends with '.com' (the search phrase is in between these pre-defined strings) | -- | SELECT *<br> FROM Product<br> WHERE Name LIKE 'Men%,L' |
| LIKE '%J%' | String contains 'J' | SELECT * <br> FROM Contact<br> WHERE LastName LIKE '%J%' | SELECT <br> FROM Product<br> WHERE Name LIKE '%Disc 1%' |
| NOT LIKE '%J%' | String does not contain 'J' | SELECT * <br> FROM Contact<br> WHERE LastName NOT LIKE '%J%‘ | SELECT ProductID, Name, ListPrice<br> FROM Product<br> WHERE Name LIKE '%Nut%' |
| _ Underscore | Matches exactly one character. Functions like the % wildcard. | -- | SELECT * <br> FROM Contact<br> WHERE LastName LIKE 'A_ams' |
| [charlist] | Matches any single character in charlist [abcdef] or [a-f], not in a specific order (i.e., the search pattern is for a set or range of characters) | -- | SELECT * <br> FROM Contact<br> WHERE EmailPromotion LIKE '[0]%' |
| LIKE '[HL]%' | Name begins with either H or L | -- | SELECT *<br> FROM Product<br> WHERE Name LIKE '[HL]%' |
| [^charlist] or<br> [!charlist] | Matches only a character NOT in brackets ([^a-f]) or set ([^abcdef]) | | |

## Arithmetic Operators
| Operator | Definition | Syntax | Example |
|--------|------------|--------|----------------|
| =+ (addition) | Adds values on either side of the operator | SELECT (col1 + col2) AS alias | SELECT (SubTotal+Freight) AS TotalDue<br> FROM SalesOrderHeader; |
| - (subtraction) | Subtracts right hand operand from left hand operand | SELECT (col1 - col2) AS alias | SELECT *<br> FROM SalesOrderHeader<br> WHERE (TotalDue-TaxAmt-Freight) = Subtotal; |
| * (multiplication) | Multiplies values on either side of the operator | SELECT<br> col1*col2 AS alias | SELECT (UnitPrice*OrderQty) AS TotalCost<br> FROM <br> PurchaseOrderDetail; |
| / (division) | Divides left hand operand by right hand operand | SELECT col1 / col2 AS alias | SELECT UnitPrice,(UnitPrice*5/100) AS Commission<br> FROM PurchaseOrderDetail; |

## System Functions  
| Operator | Definition | Syntax | Example |
|--------|------------|--------|----------------|
| LEFT() | Returns the leftmost number of characters as specified | SELECT colname, <br> LEFT(colname, # of characters) | SELECT Left(LastName,3) As LeftThree<br> FROM Contact; |
| RIGHT() | Returns the specified rightmost number of characters | SELECT colname, <br> RIGHT(colname, # of characters) | SELECT Right(LastName,3) As RightThree<br> FROM Contact; |
| <a target="_blank" href="http://function_rtrim/">RTRIM()</a>* | Removes trailing spaces (i.e., whitespaces from the right) | SELECT RTRIM(colname) | SELECT  <br>  RTRIM(FirstName)+&#39; &#39;+ RTRIM(LastName) AS Name<br> FROM <br>  Contact |
| <a target="_blank" href="http://function_ltrim/">LTRIM()</a>* | Removes leading spaces (i.e., whitespaces from the left) | SELECT LTRIM(colname) | SELECT  <br>  LTRIM(FirstName)+&#39; &#39;+ LTRIM(LastName) AS Name<br> FROM <br>  Contact |
|   example (variation) | LTRIM and RTRIM | -- | SELECT  <br>  LTRIM(RTRIM(FirstName))+&#39; &#39;+ LTRIM(RTRIM(LastName)) AS Name<br> FROM <br>  Contact |
| UPPER() | Returns the argument in uppercase | SELECT UPPER(colname) | SELECT Name, UPPER(Name) As UpperCaseName<br> FROM Product; |
| LOWER() | Returns the argument in lowercase | SELECT LOWER(colname) | SELECT Name, LOWER(Name) As LowerCaseName<br> FROM Product |
| LENGTH() | Returns the length of a string in bytes | WHERE LENGTH(colname) = integer | -- |
| SOUNDEX() | Returns a soundex string | WHERE SOUNDEX(colname) = SOUNDEX(&#39;rowvalue&#39;) | SELECT cust_name, cust_contact<br> FROM Customers<br> WHERE SOUNDEX(cust_contact) = SOUNDEX(&#39;Michael Green&#39;); |

## Date and Time Functions
| Operator | Definition | Syntax | Example |
|--------|------------|--------|----------------|
| GETDATE() | Returns the current date and time | GETDATE() | SELECT *<br> FROM Contact<br> WHERE DATEPART(mm,ModifiedDate) = DATEPART(mm,GETDATE()); |
| date(&#39;now&#39;) | SQLite function to return the current date and time; equivalent to GETDATE() | date(&#39;now&#39;) | SELECT *<br>FROM Orders<br>WHERE order_date &gt;= date(&#39;now&#39;, &#39;start of year&#39;) AND order_date &lt;  date(&#39;now&#39;, &#39;start of year&#39;, &#39;+1 year&#39;); |
| DATEPART() | Returns a single part of a date/time (notice that these examples are all WHERE statements vs. SELECT statements; please see DATENAME() for SELECT statements and date formatting) | WHERE DatePart(yyyy,ModifiedDate) =&gt;&lt; year | SELECT *<br> FROM Contact<br> WHERE DATEPART(yyyy,ModifiedDate) = 2005 |
|   mm | returns dates occurring in January across all dates in the ModifiedDate column | WHERE DATEPART(mm,ModifiedDate) =&gt;&lt; month | SELECT *<br> FROM Contact<br> WHERE DATEPART(mm,ModifiedDate) &lt; 2 |
|   dd | returns dates on the 1st of each month across all dates in the ModifiedDate column | WHERE DATEPART(dd,ModifiedDate) &lt; day of month | SELECT *<br> FROM Contact<br> WHERE DATEPART(dd,ModifiedDate) &lt; 2 |
| DATEADD() | Adds or subtracts a specified time interval from a date and returns a date | SELECT DATEADD(Day,21,column_name) AS Alias | SELECT DueDate<br> FROM PurchaseOrderDetail |
|   example | the SELECT statement syntax used to add 21 days to the DueDate column | -- | SELECT ProductID, DueDate,DATEADD(Day,21,DueDate) AS NewDueDate<br> FROM PurchaseOrderDetail |
| DATEDIFF() | Returns the time between two dates as number of days/hours/months/years/weeks etc. | SELECT DATEDIFF(Day,DateColumnName,GETDATE()) AS NumberOfDays | SELECT FirstName, LastName, ModifiedDate, DATEDIFF(day,ModifiedDate, GetDate()) AS numberOfDays<br> FROM Contact |
|   example 1 | Count the difference in the number of days from the due date to the current date | SELECT DATEDIFF(Day,DueDate,GETDATE()) AS NumberOfDays | SELECT <br>  DueDate,DATEDIFF(Day,DueDate,GETDATE()) AS numberOfDays<br> FROM <br>  PurchaseOrderDetail |
|   example 2 | Return number of days between current date and when employee was hired | SELECT DATEDIFF(Day,HireDate,GETDATE()) AS NumberOfdays | SELECT HireDate, GETDATE() as TodaysDate, DATEDIFF(Day,HireDate,GETDATE()) AS NumberOfDays<br> FROM Employee |
|   example: hour | Return number of hours between two points in time using the DATEDIFF() function | SELECT DATEDIFF(hour,DateColumnName,GETDATE()) AS NumberOfHours | SELECT FirstName, LastName, ModifiedDate, DATEDIFF(hour,ModifiedDate, GetDate()) AS NumberOfHours |
| <a target="_blank" href="http://www.w3schools.com/sql/func_convert.asp">CONVERT()</a>* | Displays date/time data in different formats; converts one data type to another data type (in general) | SELECT CONVERT(Char(12), GetDate(), 101) as TodaysDate | SELECT CONVERT(Char(12), HireDate, 101) as HireDate, CONVERT(Char(12), GetDate(), 101) as TodaysDate, DATEDIFF(Day,HireDate,GETDATE()) AS NumberOfdays<br> FROM Employee |
| DATENAME() | returns the month (&#39;month&#39;) from the specified date | SELECT DATENAME(month,GetDate()) AS &#39;Month Name&#39; | SELECT <br>  CONVERT(Char(12),DueDate, 101) AS DueDate,<br>  DATENAME(month,DueDate) AS &#39;Month Name&#39; <br> FROM <br>  PurchaseOrderDetail |
|   m for month | returns the month (&#39;m&#39;) from the specified date | DATENAME(m,GetDate()) | SELECT <br>  CONVERT(Char(12),DueDate, 101) AS DueDate,<br>  DATENAME(m,DueDate) AS &#39;Month Name&#39; <br> FROM <br>  PurchaseOrderDetail |
|   dw for weekday | returns the weekday (&#39;dw&#39;) from the specified date | DATENAME(dw,GetDate()) | SELECT <br>  CONVERT(Char(12),DueDate, 101) AS DueDate,<br>  DATENAME(dw,DueDate) AS &#39;Day of the Week&#39; <br> FROM <br>  PurchaseOrderDetail |
|   yy for year | returns the year (&#39;yy&#39;) from the specified date | DATENAME(yy,GetDate()) | SELECT <br>  CONVERT(Char(12),DueDate, 101) AS DueDate,<br>  DATENAME(yy,DueDate) AS &#39;Year&#39; <br> FROM <br>  PurchaseOrderDetail |
| DATEFROMPARTS() | returns the date part from a date column; used with the UPDATE statement to change a date in a column&#39;s month, date and/or year | DATEFROMPARTS(YEAR(column_name), MONTH(column_name), DAY(column_name)) | -- |
|   month | change the month in a date column (see example &gt;&gt;) to a specified month | DATEFROMPARTS(YEAR(column_name), 10, DAY(column_name)) | UPDATE dbo.Employee<br>SET BirthDate = DATEFROMPARTS(YEAR(BirthDate), 10, DAY(BirthDate))<br>WHERE EmployeeID = 224; |

## String Functions
| Function | Description | Syntax | Example |
|--------|------------|--------|----------------|
| Concatenation | concatenating without CONCAT() | SELECT Col1 + &#39; &#39; + Col2 AS alias | SELECT Name+&#39;(&#39;+ AccountNumber+&#39;)&#39;<br> FROM Vendor |  |  |
| CONCAT() | basic CONCAT() usage | SELECT CONCAT(Col2, &#39; &#39;, Col3, &#39; &#39;, Col4) AS alias | SELECT CONCAT(FirstName, &#39; &#39;, LastName)<br> FROM Customer; |  |  |
|   multiple columns | at least two variables in the SELECT statement | SELECT Col1, Concat(Col2, &#39; &#39;, Col3, &#39; &#39;, Col4) AS alias | SELECT CustomerID, CONCAT(FirstName, &#39; &#39;, LastName)<br> FROM Customer; |  |  |
| Alias | An alternate name for a field or a value, assigned by the AS keyword | SELECT colname AS alias | SELECT Quantity*Price AS &#39;Subtotal&#39; |  |  |
|   for a column | To combine two columns in a SELECT statement and give it a new aliases Name we use the “AS” keyword | SELECT colname+‘(‘ + colname+‘)’ AS alias <br> FROM table | SELECT Name+&#39;(&#39;+AccountNumber+&#39;)&#39; AS VendorNameNumber<br> FROM Vendor |  |  |
|   for a table | &quot;&quot; | SELECT colname<br> FROM tablename AS alias | &quot;&quot; |  |  |

## Aggregate Functions
| Function | Description | Syntax | Example |
|--------|------------|--------|----------------|
| AVG() | returns a column&#39;s average value; ignores null values | see example &gt;&gt; | SELECT avg(prod_price) as avg_price |
| COUNT(*) | returns the number of rows in a column; counts null values with COUNT(*) | see example &gt;&gt; | SELECT COUNT(*) as &#39;numberOfCustomers&#39; FROM Customers |
| COUNT(column_name) | returns the number of rows in a column; ignores null values with COUNT(column_name) | see example &gt;&gt; | SELECT COUNT(cust_email) as &#39;emailCount&#39; FROM Customers |
| MAX() | returns a column&#39;s highest value; ignores null values | see example &gt;&gt; | SELECT MAX(prod_price) as &#39;HighestProdPrice&#39; FROM Products |
| MIN() | returns a column&#39;s lowest value; ignores null values | see example &gt;&gt; | SELECT MIN(prod_price) as &#39;LowestProdPrice&#39; FROM Products |
| SUM(column_name) | returns the sum of a set of a column&#39;s values; ignores null values | see example &gt;&gt; | SELECT SUM(quantity) as &#39;items_ordered&#39; FROM OrderItems WHERE order_num = 20005 |
| SUM(col1*+-/col2) | returns the sum of a set of a calculated value (such as an alias column); ignores null values | see example &gt;&gt; | SELECT SUM(item_price*quantity) AS &#39;total_price&#39; FROM OrderItems WHERE order_num = 20005 |

## The GROUP BY Clause
| Objective | Description | Syntax | Example |
|--------|------------|--------|----------------|
| GROUP BY basic usage |  | SELECT <br>  <span style="color:#ff00ff;">col1name</span>,<br>  COUNT(*) AS NewColName <br>FROM tablename<br>GROUP BY <span style="color:#ff00ff;">col1name</span> | SELECT <br>  <span style="color:#ff00ff;">VendorID</span>, <br>  Count(*) AS TotalNumberProducts <br>From ProductVendor<br>GROUP BY <span style="color:#ff00ff;">VendorID</span> |
| + HAVING clause with an operator |  | SELECT <br>  <span style="color:#ff00ff;">col1name</span>, <br>  COUNT(*) AS NewColName <br>FROM tablename<br>GROUP BY <span style="color:#ff00ff;">col1name</span><br>HAVING COUNT(*) =&gt;&lt;!= <span style="color:#0000ff;">[value]</span> | Select<br>  <span style="color:#ff00ff;">EmployeeID</span>,<br>  SUM(VacationHours)<br>FROM Employee <br>GROUP BY <span style="color:#ff00ff;">EmployeeID<br></span>HAVING SUM(VacationHours) &gt; 20 |
| + HAVING clause with COUNT(*) |  |  | SELECT <br>  <span style="color:#ff00ff;">VendorID</span>, <br>  Count(*) AS TotalProducts <br>FROM ProductVendor<br>GROUP BY <span style="color:#ff00ff;">VendorID</span><br>HAVING COUNT(*) &gt;= 10 |
| + HAVING clause and WHERE clause | the HAVING clause filters out entire groups (as opposed to the WHERE clause which filters out rows) |  | SELECT <br>  VendorID, <br>  COUNT(*) AS TotalProducts <br>FROM ProductVendor<br>WHERE StandardPrice &lt;=50<br>GROUP BY VendorID<br>HAVING COUNT(*) &gt;=10 |
|  | An example of an operation that allows you to return calculated data in groups but filtering for specific group totals | SELECT <br>  columnname, <br>  COUNT(*) AS NewColumnName <br>FROM tablename<br>GROUP BY columnName<br>HAVING Count(*) operator value<br>ORDER BY columnName | SELECT <br>  SalesOrderID, <br>  SUM(OrderQty*UnitPrice) AS TotalCostQuantity <br>FROM SalesOrderDetail<br>GROUP BY SalesOrderID<br>HAVING SUM(OrderQty*UnitPrice)&gt;=1000 |
| + HAVING clause and a SELECT clause function |  |  | SELECT <br>  <span style="color:#ff00ff;">SalesOrderID</span>, <br>  CAST(SUM(OrderQty*UnitPrice) AS decimal(10,2)) AS TotalCostQuantity <br>FROM SalesOrderDetail<br>GROUP BY <span style="color:#ff00ff;">SalesOrderID</span><br>HAVING SUM(OrderQty*UnitPrice)&gt;=1000 |
| + HAVING clause, a SELECT clause function, and an ORDER BY clause |  |  | SELECT <br>  <span style="color:#ff00ff;">SalesOrderID</span>, <br>  Cast(SUM(OrderQty*UnitPrice) AS decimal(10,2)) AS TotalCostQuantity <br>FROM SalesOrderDetail<br>GROUP BY <span style="color:#ff00ff;">SalesOrderID</span><br>HAVING SUM(OrderQty*UnitPrice)&gt;=2000<br>ORDER BY SalesOrderID, TotalCostQuantity |

## Subqueries
| Objective | Description | Syntax | Example |
|--------|------------|--------|----------------|
| Subquery in the WHERE clause | A method to filter results | -- | SELECT CustomerID<br>FROM SalesOrderHeader<br>WHERE <span style="color:#ff00ff;">SalesOrderID</span> IN (SELECT <span style="color:#ff00ff;">SalesOrderID</span><br> FROM SalesOrderDetail<br> WHERE ProductID=897); |
| outer query | | SELECT column1 <br>FROM table<br>WHERE <span style="color:#ff00ff;">column2</span> IN (<span style="color:#ff6d01;">the subquery itself</span> or <span style="color:#9900ff;">the results derived from subquery</span>) | SELECT CustomerID<br>FROM SalesOrderHeader<br>WHERE <span style="color:#ff00ff;">SalesOrderID</span> IN (<span style="color:#9900ff;">51823,51875</span>) |
| subquery | | (<span style="color:#ff6d01;">SELECT</span> <span style="color:#ff00ff;">column2</span> <br> <span style="color:#ff6d01;">FROM table<br> WHERE column3 = 'VALUE'</span>) | (<span style="color:#ff6d01;">SELECT</span> <span style="color:#ff00ff;">SalesOrderID</span><br> <span style="color:#ff6d01;">FROM SalesOrderDetail<br> WHERE ProductID = 897</span>) |
| Two subqueries in the WHERE clause | | "" | SELECT (FirstName +' '+ LastName) AS CustomerName FROM Contact WHERE ContactID IN (SELECT ContactID FROM SalesOrderHeader WHERE SalesOrderID IN (SELECT SalesOrderID FROM SalesOrderDetail WHERE ProductID=897)); |
| Subquery in the SELECT clause | Subquery is placed in the SELECT clause as a calculated field | see example >> | SELECT FirstName+' '+LastName AS Customer,<br> (SELECT Count()<br> FROM SalesOrderHeader<br> WHERE SalesOrderHeader.ContactID = Contact.ContactID) AS Orders<br>FROM Contact<br>ORDER BY Customer |
| Subqueries with fully qualified domain names | | | SELECT FirstName+' '+LastName AS Customer,<br> (SELECT Count()<br> FROM SalesOrderHeader s<br> WHERE s.ContactID = c.ContactID) AS Orders<br>FROM Contact c<br>ORDER BY Customer |
| Subqueries with an INSERT statement | The INSERT statement uses the data returned from the subquery to insert into another table. The selected data in the subquery can be modified with any of the character, date or number functions | INSERT INTO table_name <br>(column1 , column2 )<br>SELECT column1, column2<br>FROM table1 <br>WHERE [OPERATOR] [VALUE] | INSERT INTO Location<br>( Name, <br> CostRate, <br> Availability,<br> ModifiedDate)<br>Values<br>( 'Test',<br> 10,<br> 10,<br> GetDate() |
| Subqueries with an UPDATE statement | The subquery can be used in conjunction with the UPDATE statement. Either single or multiple columns in a table can be updated when using a subquery with the UPDATE statement. | UPDATE table<br>SET column_name = new_value<br>WHERE OPERATOR VALUE<br>(<br> SELECT COLUMN_NAME<br> FROM TABLE_NAME WHERE<br>) | Update Location<br>Set Name = 'Test3'<br>Where LocationID = <br>(<br>Select <br> LocationID<br>FROM Location<br>Where LocationID = 2<br>) |
| Subqueries with a DELETE FROM statement | | DELETE FROM TABLE_NAME<br>WHERE OPERATOR VALUE<br> (SELECT COLUMN_NAME<br> FROM TABLE_NAME<br> WHERE) | |

## Unions
| Objective | Description | Syntax | Example |
|--------|------------|--------|----------------|
| UNION statements | Allows you to join multiple datasets into one dataset. Requires:<br>- the number and the order of the columns must be the same in all queries.<br>- the data types must be compatible.<br>Also:<br>- only one ORDER BY clause is required if an ORDER BY clause is needed | SELECT <span style="color:#ff00ff;">colnameA</span>, <span style="color:#0000ff;">colnameB</span> FROM table1<br>UNION<br>SELECT <span style="color:#ff00ff;">colnameA</span>, <span style="color:#0000ff;">colnameB</span> FROM table1<br><br>In practice, where UNION is really useful is when you need to combine data from multiple tables, even tables with mismatched column names, in which case you can combine UNION with aliasese to retrieve a single set of results. (pg. 144) | |
| UNION | returns only distinct records resulting from the UNION (i.e., removes duplicate rows)<br><br>Returns the same data as this query using the WHERE clause:<br><br>SELECT v.ProductID, v.VendorID, v.StandardPrice<br>FROM ProductVendor v <br>WHERE v.StandardPrice <= 42.2100<br>OR v.VendorID IN (50,83)<br>ORDER BY v.StandardPrice ASC | see example >> | SELECT <br> v.ProductID, <br> v.VendorID,<br> v.StandardPrice<br>FROM <br> ProductVendor v<br>Where v.StandardPrice <= 42.2100<br>UNION<br>SELECT <br> v.ProductID, <br> v.VendorID,<br> v.StandardPrice<br>FROM <br> ProductVendor v<br>Where v.VendorID IN (50,83)<br>ORDER BY v.StandardPrice ASC; |
| UNION ALL | returns all records resulting from the UNION (i.e., does not remove duplicate rows)<br><br>For example, if you used the UNION ALL function on a table with itself (let's say, a table with 290 rows), you'd multiply the number of rows by the number of UNION ALL commands in your statement to get 870 rows (because UNION ALL does not remove duplicate records; compare this to the same situation but with a UNION statement) | see example >> | SELECT <br> v.ProductID, <br> v.VendorID,<br> v.StandardPrice<br>FROM <br> ProductVendor v<br>Where v.StandardPrice <= 42.2100<br>UNION ALL<br>SELECT <br> v.ProductID, <br> v.VendorID,<br> v.StandardPrice<br>FROM <br> ProductVendor v<br>Where v.VendorID IN (50,83)<br>ORDER BY v.StandardPrice ASC; |

## Joins
| Objective | Description | Syntax | Example |
|--------|------------|--------|----------------|
| INNER JOIN | An equijoin specified in either the FROM or WHERE clause that: <br>- returns all the columns in both tables<br>- returns only the rows for which there is an equal VALUE in the join column<br><br>Additional notes:<br>- does not keep unmatched rows<br>- returns only matched rows across tables | -- | -- |
| + all columns selected | -- | SELECT *<br>FROM Table_name1 t1 <br>INNER JOIN Table_name2 t2<br>ON t2.column_name = t1.column_name; | SELECT *<br>FROM Employee AS e<br>  INNER JOIN Contact AS c<br>  ON e.ContactID = c.ContactID<br>ORDER BY c.LastName; |
| + columns specified | -- | SELECT Column_Name, Column_Name<br>FROM Table_name1 t1 <br>INNER JOIN Table_name2 t2<br>ON t2.column_name = t1.column_name; | SELECT ProductVendor.VendorID, Product.ProductID, Name<br>FROM ProductVendor INNER JOIN Product <br>ON ProductVendor.ProductID = Product.ProductID |
| + columns specified + SELECT clause function | -- | see example &gt;&gt; | SELECT Top 10 ProductVendor.VendorID, Product.ProductID, Name<br>FROM ProductVendor INNER JOIN Product ON ProductVendor.ProductID = Product.ProductID<br>ORDER BY VendorID |
| + columns specified + SELECT clause function + ORDER BY clause + WHERE clause | -- | see example &gt;&gt; | SELECT TOP 100 P.ProductID, P.Name, P.ListPrice, P.Size, P.ModifiedDate, SOD.UnitPrice, SOD.UnitPriceDiscount, SOD.OrderQty, SOD.LineTotal <br>FROM SalesOrderDetail SOD INNER JOIN Product P <br>ON SOD.ProductID = P.ProductID <br>WHERE SOD.UnitPrice &gt; 1000 <br>ORDER BY SOD.UnitPrice DESC |
| OUTER JOIN | This type of join:<br>- returns table rows that have no associated rows in the related table (i.e, null values are included)<br>- is specified in the FROM clause only | -- | -- |
| LEFT OUTER JOIN | Unlike an inner join, the outer join will return every row from one specified table (the left side in this case), even if the join condition fails (i.e., left side keeps unmatched rows).<br><br>Additional notes:<br>- keep all left rows<br>- null values on the right side if there isn&#39;t a match<br>- outer joins are specified in the FROM clause only | see example &gt;&gt; | SELECT<br>  Contact.LastName,<br>  SalesOrderHeader.SalesOrderID<br>FROM<br>  Contact LEFT OUTER JOIN SalesOrderHeader <br>ON Contact.ContactID = SalesOrderHeader.ContactID <br>ORDER BY Contact.LastName ASC; |
| RIGHT OUTER JOIN | Same as a LEFT OUTER JOIN except for the right table; return every row from the right table even if the join condition fails (i.e., right side keeps unmatched rows).<br><br>Additional notes:<br>- keep all right rows<br>- null values on the left side if there isn&#39;t a match<br>- outer joins are specified in the FROM clause only<br>- SQLITE doesn&#39;t support this | see example &gt;&gt; | SELECT<br>  st.Name AS Territory, <br>  sp.SalesPersonID<br>FROM<br>  SalesTerritory st<br>RIGHT OUTER JOIN SalesPerson sp <br>ON st.TerritoryID = sp.TerritoryID ; |
| FULL JOIN | Both sides; union of matches and unmatched |  | SELECT ...<br>FROM a<br>FULL OUTER JOIN b ON a.key = b.key; |  |  |
| Implicit joins | A join via the WHERE clause that does not require an explicit JOIN statement; returns the same results as INNER JOIN | see example &gt;&gt; | SELECT ProductVendor.VendorID, Product.ProductID, Product.Name<br>FROM ProductVendor, Product <br>WHERE ProductVendor.ProductID = Product.ProductID |
| CROSS JOIN | A join that returns rows that are multiplication of record number from both the tables (each row on left table will related to each row of right table); AKA a Cartesian join | see example &gt;&gt; | SELECT p.SalesPersonID, t.Name AS Territory<br>FROM SalesPerson p CROSS JOIN SalesTerritory t<br>ORDER BY p.SalesPersonID; |
| Self joins | A join in which the table is joined to itself<br><br>Note how the aliases for each column name aligns with the aliases for the table name<br>- Any column name that is duplicated between two or more tables referenced in the query must be qualified with the table name. | see example &gt;&gt; | SELECT e1.ManagerID AS ManagerID, e2.EmployeeID EmployeeID<br>FROM <span style="color:#ff00ff;">Employee e1</span> INNER JOIN <span style="color:#ff00ff;">Employee e2</span><br>ON e2.<span style="color:#0000ff;">ManagerID</span> = e1.<span style="color:#ff6d01;">EmployeeID</span><br>ORDER BY e1.ManagerID |
| + more columns specified in the SELECT clause + ORDER BY clause | -- | see example &gt;&gt; | SELECT e1.EmployeeID as ManagerID, e1.Title as ManagerTitle, e2.EmployeeID, e2.Title as EmployeeTitle<br>FROM Employee e1 JOIN Employee e2<br>ON e2.ManagerID = e1.EmployeeID<br>ORDER BY e1.ManagerID |
| Multiple table join | Although each join specification joins only two tables, the FROM clauses can contain multiple join specifications. This allows many tables to be joined for a single query. | see example &gt;&gt; | SELECT p.Name As ProductName, v.Name AS VendorName<br>FROM Product p INNER JOIN ProductVendor pv ON p.ProductID = pv.ProductID<br>INNER JOIN Vendor v<br>ON pv.VendorID = v.VendorID<br>WHERE ProductSubcategoryID = 15<br>ORDER BY <span style="color:#000000;">v.Name</span> |
| Joins with aggregate functions | INNER JOINs and OUTER JOINs with aggregate functions share the same exact syntax (just replace OUTER JOIN with INNER JOIN and vice versa with the provided example) | see example &gt;&gt; | SELECT<br>   c.ContactID,<br>   c.LastName,<br>   COUNT(s.SalesOrderID) AS OrderID<br>FROM Contact c INNER JOIN SalesOrderHeader s ON c.ContactID = s.ContactID<br>GROUP BY<br>   c.LastName,<br>   c.ContactID |
| Natural join | A join that eliminates multiple occurences of the same column so that only one of each column is returned; requires you to select only columns that are unique yourself (which is accomplished through a wildcard SELECT * statement and then explicitly identifying columns for all other tables) | see example &gt;&gt; | SELECT C.*, O.order_num, O.order_date, OI.prod_id, OI.quantity, OI.item_price<br>FROM <br>  Customers AS C, <br>  Orders as O, <br>  OrderItems AS OI<br>WHERE <br>  C.cust_id = O.cust_id <br>  AND OI.order_num = O.order_num <br>  AND prod_id = &#39;RGAN01&#39;; |

## Updating, Deleting and Inserting Data
| Objective | Description | Syntax | Example |
|--------|------------|--------|----------------|
| INSERT INTO | There are basically two ways to INSERT data INTO a table: One is to INSERT it one row at a time, the other is to INSERT multiple rows at a time | -- | -- |
| single row | a single INSERT INTO statement | INSERT INTO tablename<br>(column,column,column,column,column,column,column,column)<br>VALUES(<br>'VALUE',<br>'VALUE',<br>'VALUE',<br>'VALUE', NULL, NULL<br>) | INSERT INTO Customers<br>(cust_id, cust_name, cust_address, cust_city, cust_state, cust_zip, cust_country, cust_contact, cust_email)<br>VALUES(<br>'100010',<br>'Pep E. LaPew', '100 Main Street', 'Los Angeles', 'CA',<br>'90046', NULL, NULL, NULL<br>) |
| multiple rows | multiple INSERT INTO statements (one for each row) | see example >> | INSERT INTO customers<br>(cust_id, cust_name,<br>cust_address, cust_city, cust_state,<br>cust_zip, cust_country, cust_contact, cust_email) <br>VALUES ('100012', 'Pep E. Lapew', <br>'100 Main Street', 'Los  Angeles', 'CA',<br>'91108','USA',<br>'Pep E. Lapew', '[plapew@plapew.org](mailto:plapew@plapew.org)')<br><br>INSERT INTO customers<br>(cust_id, cust_name, cust_address, cust_city, cust_state, cust_zip, cust_country, cust_contact, cust_email) VALUES<br>('100013', 'M. Martin', '42 Galaxy Way', 'New York','NY',<br>'11213','USA','M. Martin', '[mmartin@mmartin.org](mailto:mmartin@mmartin.org)') |
| SELECT INTO | Another way to add data is using the INTO in a SELECT statement. This allows you to INSERT data from a single table or multiple tables using table joins. You can think of the SELECT INTO as being an export operation.<br><br>The INTO statement allows you to copy the data from one table into a new table. The keyword INTO actually creates the new table. | see example >> | SELECT<br>cust_id, cust_name, cust_address, cust_city, cust_state, cust_zip, cust_country, cust_contact, cust_email INTO<br>customers2<br>FROM Customers;<br><br>-- Insert a row to the new customers2 table<br>INSERT INTO customers2<br>(<br>cust_id, cust_name, cust_address, cust_city, cust_state, cust_zip, cust_country, cust_contact, cust_email<br>) VALUES<br>(<br>'100014', 'J. Verne', <br>'12 Timetravel Way', 'New York','NY',<br>'11213','USA',<br>'J. Verne', '[jverne@jverne.org](mailto:jverne@jverne.org)'<br>) |
| + but with different columns from the SELECT statement and the INSERT INTO statement | -- | see example >> | SELECT<br>cust_id, cust_name, cust_address, cust_city, cust_state, cust_zip, cust_country, cust_contact, cust_email <br>INTO customers2<br>From Customers;<br><br>-- Now let’s insert a row to the new customers2 table<br>INSERT INTO Customers2<br>(cust_name, cust_address, cust_city, cust_state, cust_zip, cust_country, cust_contact, cust_email<br>) <br>VALUES<br>(<br>'J. Verne', <br>'12 Timetravel Way', <br>'New York',<br>'NY',<br>'11213',<br>'USA',<br>'J. Verne',<br>'[jverne@jverne.org](mailto:jverne@jverne.org)'<br>) |
| SELECT INTO [to copy an entire table] | Used to copy the contents of a table into a brand new table; <span style="font-weight:bold;">like exporting data </span>(pg. 152)<br>- any SELECT options and clauses may be used (e.g., WHERE, GROUP BY, etc.)<br>- joins may be used to insert data<br>- data is inserted into a single table | see example >> | SELECT *<br>INTO CustCopy<br>From Customers; |
| INSERT SELECT | i.e., inserting retrieved data<br>- made up of both the INSERT and the SELECT statement. <br>- <span style="font-weight:bold;">like importing data</span><br>- if you wanted to add customers from another table to the customers table all at one time you would use the INSERT SELECT statement. | see example >> | INSERT INTO customers (<br> cust_id, cust_name, cust_address, cust_city, cust_state, cust_zip, cust_country, cust_contact, cust_email<br>)<br>SELECT cust_id, cust_name, cust_address, cust_city, cust_state, cust_zip, cust_country, cust_contact, cust_email<br>FROM Customers2<br>WHERE cust_id=’100014’ |
| INSERT Data Using WHERE Clause | - the WHERE clause is used to filter specific rows.<br>- this method allows you to limit what data you are INSERTING. | see example >> | INSERT INTO customers <br>(<br>cust_id, cust_name, cust_address, cust_city, cust_state, cust_zip, cust_country, cust_contact, cust_email<br>) <br>SELECT cust_id, cust_name, cust_address, cust_city, cust_state, cust_zip, cust_country, cust_contact, cust_email <br>FROM Customers2 <br>WHERE cust_id = '111111' |
| UPDATE | - used to modify data in a table (i.e., it updates existing records in a table); can modify specific rows or all rows in a table.<br>- the WHERE clause specifies which record or records that should be updated.<br>- all records will be updated without the WHERE clause.<br><br>- Never use an UPDATE or DELETE without the WHERE clause<br>- Make sure every table has a primary key<br>- Before using UPDATE or DELETE first test with SELECT statement<br>- Use database-enforced Referential Integrity, which will not allow rows that are referenced elsewhere to be updated/deleted without authorization or credentials to do so | -- | -- |
| single column | -- | UPDATE table_name<br>SET column1=value1<br>WHERE some_column=some_value; | UPDATE customers<br>SET cust_email = '[elmer@fudd.com](mailto:elmer@fudd.com)' <br>WHERE cust_id = '100011' |
| multiple columns | -- | UPDATE table_name<br>SET column1=value1,column2=value2<br>WHERE some_column=some_value; | UPDATE customers<br>SET cust_name = 'The Fudds', cust_email = '[elmer@fudd.com](mailto:elmer@fudd.com)' WHERE cust_id = '100011' |
| CREATE table | Creates a copy of a table from a SELECT statement | see example >> | CREATE TABLE CustCopy AS<br>SELECT * FROM Customers; |
| DELETE | - used to delete data in a table; can delete specific rows or all rows in a table<br>- to avoid deleting all records in a table, the WHERE clause should not be omitted with the DELETE statement (similar to the UPDATE statement) | DELETE FROM table_name<br>WHERE some_column=some_value; | -- |
| DELETING using the UPDATE statement | -- | see example >> | UPDATE customers<br>SET cust_city = NULL<br>WHERE cust_id = '111111' |
| DELETING a single row | -- | see example >> | DELETE FROM customers <br>WHERE cust_id = '100012' |
| ALTER TABLE | Used to modify the structure of an existing table in a database. It allows for various changes without necessarily losing the data within the table | see example >> | ALTER TABLE customers2<br>ADD CONSTRAINT pk_customers2 PRIMARY KEY (cust_id); |
| DROP TABLE | Removes all the data and the entire definition of the table, including any primary keys, indexes, foreign keys, and any link to the table | see example >> | DROP TABLE Customer2; |
| TRUNCATE TABLE | TRUNCATE TABLE removes all rows from a table just like the Delete from command. TRUNCATE TABLE is faster and uses fewer system resources because it does not log every delete transaction in the log file | see example >> | TRUNCATE TABLE customers2;<br>SELECT * <br>FROM customers2; |

## Creating Tables
| Objective | Description | Syntax | Example |
|--------|------------|--------|----------------|
| CREATE TABLE | - The column_name parameters specify the names of the columns of the table.<br>- The data_type parameter specifies what type of data the column can hold (e.g. varchar, integer, decimal, date, etc.).<br>- The size parameter specifies the maximum length of the column of the table.<br><br>- When creating a new table the table name must be unique in the database.<br>- Table columns need to be defined as a certain datatype, i.e varchar, datetime, etc.<br>- Create Primary Key (PK): You can do this during table initial creation or after. PK only on columns that do not allow NULL | CREATE TABLE table_name<br>(<br>column_name1 data_type(size),<br>column_name2 data_type(size),<br>column_name3 data_type(size)<br>); | CREATE TABLE Products2<br>(<br>prod_id CHAR(10) NOT NULL,<br>vend_id CHAR(10) NOT NULL,<br>prod_name CHAR(254) NOT NULL,<br>prod_price DECIMAL(8,2) NOT NULL,<br>prod_desc VARCHAR(1000) NULL<br>); |
| all columns required | -- | see example >> | CREATE TABLE Orders<br>(<br>order_num INTEGER NOT NULL,<br>order_date DATETIME NOT NULL,<br>cust_id CHAR(10) NOT NULL<br>); |
| NULL and NOT NULL values, where NULL isn't specified | -- | see example >> | CREATE TABLE Vendors<br>(<br>prod_id CHAR(10) NOT NULL,<br>vend_id CHAR(50) NOT NULL,<br>prod_name CHAR(50) ,<br>prod_price CHAR(50) ,<br>prod_desc CHAR(5) ,<br>prod_desc CHAR(10) ,<br>prod_desc CHAR(50)<br>); |
| DEFAULT 1 | instructs the DBMS to use a quantity of 1 of no quantity is specified | see example >> | CREATE TABLE OrderItems<br>(<br>order_num INTEGER NOT NULL,<br>order_item INTEGER NOT NULL,<br>prod_id CHAR(10) NOT NULL,<br>quantity INTEGER NOT NULL DEFAULT 1,<br>item_price DECIMAL(8,2) <br>); |
| create a table and set the primary key | - Creates the Primary, sets it as an Identity Key and set the CreatedDateTime as Default GetDate() <br>- This is done on the initial table creation | see example >> | CREATE TABLE Persons2<br> (<br> PersonID int Identity(1,1) Primary Key,<br> LastName varchar(255),<br> FirstName varchar(255),<br> Address varchar(255),<br> City varchar(255),<br>CreatedDateTime DateTime Default GetDate()<br> ); |
| ALTER TABLE | updates a table by adding, deleting or modifying columns in an existing table<br>- Specify the table you want to ALTER<br>- Specify the list of changes to be made<br>- Use ALTER statement to create Foreign Keys | -- | -- |
| add column | Adds columns to a table | ALTER TABLE table_name<br>ADD column_name datatype | ALTER TABLE Vendors<br>ADD vend_phone CHAR(20) |
| edit a column | Edits a column's data type | ALTER TABLE table_name<br>ALTER COLUMN column_name datatype | ALTER TABLE Persons2<br>ALTER COLUMN Address VARCHAR(100) |
| edit a column's default value | Sets a column to a default value | see example >> | ALTER TABLE Person2<br>ADD DEFAULT 'Los Angeles' FOR city |
| edits a column's default value | Drops a column's DEFAULT constraint | see example >> | ALTER TABLE Persons<br>ALTER COLUMN City DROP DEFAULT |
| edit a column's primary key | To modify a table and add a primary key, use the ALTER TABLE command | see example >> | ALTER TABLE vendors2<br>ADD CONSTRAINT pk_vendors2 PRIMARY KEY (vend2_id); |
| set two primary keys | sets two primary keys for a given table | see example >> | ALTER TABLE orderitems2<br>ADD CONSTRAINT pk_orderitems2 PRIMARY KEY (order2_num, order_item); |
| + DROP COLUMN | drops columns from a table | see example >> | ALTER TABLE Vendors<br>DROP COLUMN vend_phone; |
| DROP TABLE | drops an entire table | see example >> | DROP TABLE CustCopy; |

## Creating Views
| Objective | Description | Syntax | Example |
|--------|------------|--------|----------------|
| CREATE VIEW ... AS | a statement to create a virtual table; unlike tables that contain data, views simply contain queries that dynamically retrieve data when used. always shows up-to-date data.<br><br>Requirements:<br>- Must have unique name<br>- No limit as to number of views<br>- You must have security access<br>- Views can be nested<br>- Views cannot be indexed<br>- ORDER BY is prohibited in view queries*<br>- every column returned must be named (which requires the use of aliases if columns are calculated fields)<br>- some DBMSs treat views as read-only queries**<br>- some DBMSs allow you to create views that do not allow rows to be inserted or updated if that insertion or update will cause that row to no longer be a part of that view*** | CREATE VIEW view_name AS<br>SELECT column_name(s)<br>FROM table_name<br>WHERE condition | CREATE VIEW ProductCustomers AS<br>SELECT cust_name, cust_contact, prod_id<br>FROM Customers, Orders, OrderItems<br>WHERE Customers.cust_id = Orders.cust_id AND OrderItems.order_num = Orders.order_num |
| [additional query] | a query pulling from the view created in the above CREATE VIEW statement example | see example >> | SELECT cust_name, cust_contact<br>FROM ProductCustomers<br>WHERE prod_id = 'RGAN01';<br><br>-- in this case, ProductCustomers is a <span style="font-weight:bold;">view</span> created from another query and we are pulling from this table with the above query |
| CREATE VIEW + concatentation | another CREATE VIEW statement but this time with a concatenation use case | see example >> | CREATE VIEW VendorLocations AS<br>SELECT RTRIM(vend_name) + ' (' + RTRIM(vend_country) + ')' AS vend_title<br>FROM Vendors; |
| [additional query] | -- | -- | SELECT * <br>FROM VendorLocations; |
| CREATE VIEW + WHERE clause | another CREATE VIEW statement but this time with a WHERE clause | see example >> | CREATE VIEW CustomerEmailList AS<br>SELECT cust_id, cust_name, cust_email<br>FROM Customers<br>WHERE cust_email IS NOT NULL; |
| [additional query] | -- | -- | SELECT * <br>FROM CustomerEmailList; |
| CREATE VIEW + calculated fields + column aliases | another CREATE VIEW statement but this time with calculated fields and aliases | see example >> | CREATE VIEW OrderItemsExpanded AS<br>SELECT order_num,<br> prod_id,<br> quantity,<br> item_price,<br> quantity*item_price AS expanded_price<br>FROM OrderItems; |
| [additional query] | -- | -- | SELECT *<br>FROM OrderItemsExpanded<br>WHERE order_num = 20008; |

## Transactions
| Objective | Description | Syntax | Example |
|--------|------------|--------|----------------|
| BEGIN/COMMIT TRANSACTION | SQL requires that you explicitly mark the beginning and end of a transaction | BEGIN TRANSACTION<br>...<br>COMMIT TRANSACTION | BEGIN TRANSACTION<br>DELETE OrderItems WHERE order_num = 12345<br>DELETE Orders WHERE order_num = 12345<br>COMMIT TRANSACTION |
| + SAVE TRANSACTION + ROLLBACK TRANSACTION | see glossary >> | see example >> | BEGIN TRANSACTION<br>INSERT INTO Customers(cust_id, cust_name)<br>VALUES('100000010', 'Toys Emporium');<br>SAVE TRANSACTION StartOrder;<br>INSERT INTO Orders(order_num, order_date, cust_id)<br>VALUES(20100, '2001/12/1', '100000010');<br>IF @@ERROR <> 0 ROLLBACK TRANSACTION StartOrder;<br>INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)<br>VALUES(<span style="color:#ff00ff;">20100</span>, <span style="color:#ff00ff;">1</span>, 'BR01', 100, 5.49);<br>IF @@ERROR <> 0 ROLLBACK TRANSACTION StartOrder;<br>INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)<br>VALUES(<span style="color:#ff00ff;">20100</span>, <span style="color:#ff00ff;">2</span>, 'BR03', 100, 10.99)<br>IF @@ERROR <> 0 ROLLBACK TRANSACTION StartOrder;<br>COMMIT TRANSACTION |
| "" but with example errors | Same transaction as above except with values that produce errors (intended) | see example >> | BEGIN TRANSACTION<br>INSERT INTO Customers(cust_id, cust_name)<br>VALUES('1000000010', 'Toys Emporium');<br>SAVE TRANSACTION StartOrder;<br>INSERT INTO Orders(order_num, order_date, cust_id)<br>VALUES(20100,'2001/12/1','1000000010');<br>IF @@ERROR <> 0 ROLLBACK TRANSACTION StartOrder;<br>INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)<br>VALUES(<span style="color:#ff00ff;">20005</span>, <span style="color:#ff00ff;">3</span>, 'BR01', 100, 5.49);<br>IF @@ERROR <> 0 ROLLBACK TRANSACTION StartOrder;<br>INSERT INTO OrderItems(order_num, order_item, prod_id, quantity, item_price)<br>VALUES(<span style="color:#ff00ff;">20006</span>, <span style="color:#ff00ff;">3</span>, 'BR03', 100, 10.99);<br>IF @@ERROR <> 0 ROLLBACK TRANSACTION StartOrder;<br>COMMIT TRANSACTION |
| BEGIN + DELETE + COMMIT | Transaction to delete order number 20010 from two separate tables | see example >> | --Start the transaction<br>BEGIN TRANSACTION<br>SET IDENTITY_INSERT orderitems ON<br>--Delete all rows <br>Delete From orderitems Where order_num = 20010;<br>Delete From orders Where order_num = 20010;<br>SET IDENTITY_INSERT orderitems OFF<br>--Commit the delete statement only if no error occurs<br>Commit; |
| ROLLBACK | see glossary >> | see example >> | DELETE FROM Orders;<br>ROLLBACK; |
| ROLLBACK TRANSACTION | see glossary >> | see example >> | ROLLBACK TRANSACTION delete1; |
| SAVE TRANSACTION | see glossary >> | see example >> | SAVE TRANSACTION delete1; |

## Stored Procedures
| Objective | Description | Syntax | Example |
|--------|------------|--------|----------------|
| EXECUTE | [Example] adds a new product to the Products table | see example >> | EXECUTE AddNewProduct('JTS01',<br>'Stuffed Eiffel Tower',<br>6.49,<br>'Plush stuffed toy with the text La Tour Eiffel in red white and blue'); |
| CREATE PROCEDURE | [Example] a stored procedure that counts the number of customers in a mailing list who have email addresses | see example >> | CREATE PROCEDURE MailingListCount<br>AS<br>DECLARE @cnt INTEGER<br>SELECT @cnt = COUNT()<br>FROM Customers<br>WHERE NOT cust_email IS NULL;<br>RETURN @cnt |
| + DECLARE | invokes the CREATE PROCEDURE statement above (specific to SMSS only); specifically, it declares a variable to hold whatever the stored procedure returns, executes the stored procedure, and then uses a SELECT statement to display the returned value | see example >> | DECLARE @ReturnValue INT<br>EXECUTE @ReturnValue=MailingListCount;<br>SELECT @ReturnValue; |
| CREATE PROCEDURE | -- | see example >> | CREATE PROCEDURE NewOrder @cust_id CHAR(10)<br>AS<br>DECLARE @order_num INTEGER<br>SELECT @order_num=MAX(order_num)<br>FROM Orders<br>SELECT @order_num=@order_num+1<br>INSERT INTO Orders(order_num, order_date, cust_id)<br>VALUES (@order_num, GETDATE(), @cust_id)<br>RETURN @order_num |
| CREATE PROCEDURE | Queries the Address table and creates a variable @City, which we can specify in the statement that invokes the procedure (EXECUTE). This example assumes there will be an exact match on the City value that is passed. | see example >> | CREATE PROCEDURE uspGetAddress <br>@City nvarchar(30) <br>AS <br>SELECT * <br>FROM Address <br>WHERE City = @City |
| + EXECUTE | Invokes the previous procedure; can change the variable value to whatever and query it as needed | see example >> | EXEC uspGetAddress @City = 'New York' |
| CREATE PROCEDURE | -- | see example >> | -- this procedure gets a list of addresses based on the @City value that is passed<br>CREATE PROCEDURE uspGetAddressCount <br>@City nvarchar(30), <br>@AddressCount int OUTPUT <br>AS <br>SELECT @AddressCount = count() <br>FROM Address <br>WHERE City = @City |
| + EXECUTE | Invokes the previous procedure<br>1. declares a variable<br>2. executes the stored procedure<br>3. selects the returned valued | see example >> | DECLARE @AddressCount int EXEC uspGetAddressCount @City = 'Calgary', @AddressCount = @AddressCount OUTPUT SELECT @AddressCount |
| CREATE PROCEDURE | Creates a stored procedure to return average product price | see example >> | --Create sp to return average product price<br>CREATE PROCEDURE usp_productpricing AS<br>BEGIN<br> SELECT Avg(prod_price) AS priceaverage<br> FROM products<br>END; |
| + EXECUTE | Invokes the previous procedure | see example >> | EXEC usp_productpricing |
| CREATE PROCEDURE | see <span style="text-decoration:underline;text-decoration-skip-ink:none;-webkit-text-decoration-skip:none;color:#1155cc;"><a target="_blank" href="https://docs.google.com/document/d/1nmEaI03dukfPe-yRYf2wghnlxNnX_tUnodvIkEaiRfM/edit?tab=t.0">this doc</a></span> | see example >> | Create PROCEDURE [dbo].[usp_productpricing] <br>@price_min Money OUTPUT,<br>@price_max Money OUTPUT,<br>@price_avg Money OUTPUT<br>AS<br>BEGIN<br> SELECT @price_min= Min(prod_price)<br> FROM products;<br> SELECT @price_max= Max(prod_price)<br> FROM products;<br> SELECT @price_avg= Avg(prod_price)<br> FROM products;<br>END; |
| + GO + DECLARE + OUTPUT + SELECT | Invokes the previous procedure | see example >> | GO <br>--This declares variables to store values from parameters<br>DECLARE @cheap Money<br>DECLARE @expensive Money<br>DECLARE @average Money<br>--This code executes stored procedure and populates variables<br>exec usp_productpricing @cheap OUTPUT,<br> @expensive OUTPUT,<br> @average OUTPUT<br>--This code displays variable vaules that are passed from the parameters.<br>SELECT <br> @cheap AS Cheap, <br> @expensive AS Expensive, <br> @average AS Average |
| CREATE PROCEDURE | Passes in a parameter to the stored procedure and returns an OUTPUT parameter | see example >> | CREATE PROCEDURE usp_ordertotal<br> @order_num INT,<br> @order_total Money OUTPUT<br>AS<br>BEGIN<br> SELECT <br> @order_total = SUM(item_pricequantity)<br> FROM orderitems<br> WHERE order_num = @order_num;<br>END; |
| + DECLARE + EXECUTE + OUTPUT + SELECT | Invokes the previous procedure | see example >> | DECLARE @order_total Money<br>EXECUTE usp_ordertotal 20009, @order_total OUTPUT<br>SELECT @order_total AS OrderTotal |
| CREATE PROCEDURE | -- | see example >> | -- Name: ordertotal<br>-- Parameters: @order_num = order number<br>-- @taxable = 0 if not taxable, 1 if taxable<br>-- @order_total = order total variable<br>ALTER PROCEDURE usp_ordertotal<br> @order_num INT,<br> @taxable BIT,<br> @order_total Money OUTPUT<br>AS<br>BEGIN<br> --Declare variable for total<br> DECLARE @total Money;<br> --Declare tax percentage<br> DECLARE @taxrate INT;<br> --Set tax rate <br> SET @taxrate = 6;<br> --Get the order total<br> SELECT @total = SUM(item_pricequantity)<br> FROM orderitems<br> WHERE order_num = @order_num<br> --Is this taxable?<br> If @taxable = 1<br> --Yes, so add taxrate to the total<br> SET @total=@total+(@total/100*@taxrate);<br> -- And finally, save to OUTPUT variable<br> SELECT @order_total= @total;<br>END; |
| + DECLARE + EXECUTE + OUTPUT + SELECT | Invokes the previous procedure | see example >> | DECLARE @order_total Money<br>EXECUTE usp_ordertotal 20005, 0, @order_total OUTPUT<br>SELECT @order_total AS OrderTotal |

## Variables
| Objective | Description | Syntax | Example |
|--------|------------|--------|----------------|
| DECLARE | Declares a variable | see example >> | DECLARE @TestVariable varchar(30) <br>SET @TestVariable = 'White' <br>PRINT @TestVariable GO<br>SELECT @TestVariable AS 'Column1' |
| DECLARE | Declares a variable | see example >> | -- 1. Declare variables<br>Declare @age Int;<br>Declare @firstname Varchar(20), @lastname Varchar(20) |
| SET | Assign values to variables; sets only one variable value at a time (compare to SELECT statement, which sets multiple) | see example >> | -- 2. Set variable values<br>SET @firstname = 'Forta'        <br>SET @lastname = 'Ben'<br>SET @age = 21 |
| PRINT | Prints the variable's value | see example >> | -- 3. Output the contents<br>Print @firstname<br>Print @lastname<br>Print @age |
| + concatenate | Another variation of the same PRINT statement as above but using concatenation | see example >> | -- 3. Output the contents<br>PRINT @lastname+', '+@firstname<br>PRINT @age |
| + concatenate + CONVERT | Same PRINT statement as above but with concatenate and CONVERT | see example >> | --3. This code outputs contents<br>PRINT 'Name:'+ @lastname+', '+@firstname<br>PRINT 'Age: '+ Convert(varchar,@age) |
| + concatenate (all variables) + CONVERT | Same PRINT statement as above but concatenating all variables set in part 2; also contains a CONVERT statement | see example >> | --3. This code outputs contents<br>PRINT @firstname + @lastname + Convert(Varchar(20),@age) |
| SELECT | Assign values to variables using a SELECT statement; sets multiple variable values in a single statement (compare to SET) | see example >> | --This code declares your variables<br>Declare @age Int;<br>Declare @firstname Varchar(20), @lastname Varchar(20)<br>--This code sets the value<br>Select @firstname='Forta', @lastname='Ben', @age=21 |
| Using Variables in Statements | This task requires two select statements:<br>1. One query will return customer information for a specific customer. <br>2. The second query will return orders placed by that customer. <br>This is called BATCH-PROCESSING. Batch-Processing is a set of SQL Statements all submitted together to the Server. | see example >> | --This query returns customer data<br>SELECT cust_name, cust_email <br>FROM customers<br>WHERE cust_id = 1000000001<br><br>--This query returns orders placed by customer<br>SELECT order_num, order_date<br>FROM orders<br>WHERE cust_id = 1000000001<br>ORDER BY order_date |
| [comparison] | The following SQL code submits both statements together and returns the data we need in two separate select statements. However, in this select statement we use a declared variable for cust_id. This variable replaces the cust_id number as shown. | see example >> | --This code declares your variables<br>DECLARE @cust_id int;<br>SET @cust_id = 1000000001;<br>--This query returns customer data<br>SELECT cust_name, cust_email <br>FROM customers<br>WHERE cust_id = @cust_id<br><br>--This query returns orders placed by customer<br>SELECT order_num, order_date<br>FROM orders<br>WHERE cust_id = @cust_id<br>ORDER BY order_date |

## Conditional processing
| Objective | Description | Syntax | Example |
|--------|------------|--------|----------------|
| Using Conditional Processing | The following SQL code returns the current date and the day of the week | see example >> | --The GetDate() returns the current datetime<br>SELECT Getdate()<br>--This DatePart() returns the day of the week<br>SELECT DatePart(dw, getdate()) |
| [comparison] | An IF statement that sets a variable to either 0 or 1 based on whether or not today’s date equals the DatePart() day of the week (Sunday) | see example >> | --Declare variable<br>DECLARE @open bit<br>--Open for business today?<br>IF DatePart(dw, GetDate()) = 7<br>SET @open = 0<br>ELSE SET @open =1<br>--Output contents of @open<br>SELECT @open as OpenForBusiness |
| [comparison] | Similar to the previous example, but takes into account Saturday and Sunday | see example >> | --Declare variable<br>DECLARE @open bit<br>Declare @dow numeric<br>--Get  day of week <br>SET @dow = DatePart(dw, GetDate());<br>--Open for business today?<br>IF @dow = 6 or @dow = 7 SET @open = 0<br>ELSE SET @open =1<br>--Output contents of @open<br>SELECT @open as OpenForBusiness |
| [comparison] | Similar to the previous example, but does not use the new @dow variable | see example >> | --Declare variable<br>DECLARE @open bit<br>DECLARE @dow INT<br>--Open for business today?<br>IF DatePart(dw, GetDate()) = 6 or DatePart(dw, GetDate()) = 7 <br>SET @open = 0<br>ELSE SET @open =1<br>--Output contents of @open<br>SELECT @open as OpenForBusiness |
| Grouping statements | Executes multiple statements in a block; uses an IF/ELSE statement | see example >> | --Declare variable<br>DECLARE @open bit<br>DECLARE @dow INT, @process bit<br>--Get day of week <br>SET @dow = DatePart(dw, GetDate());<br>--Open for business today?<br>IF @dow = 6 or @dow = 7<br>  BEGIN<br>    SET @open = 0<br>    SET @process = 0<br>  END<br>ELSE<br>  BEGIN<br>    SET @open =1<br>    SET @process = 1<br>  END<br>--Output contents of @open<br>SELECT @open as OpenForBusiness |
| Looping statements | Looping is the ability to repeat blocks of code. Looping is executed using the WHILE statement. | see example >> | --Declare variable<br>Declare @counter INT<br>--Populate variable<br>SET @counter=1<br>--Execute while equal or less then 10<br>WHILE @counter <= 10<br>--Begin define block of code to excute<br>BEGIN<br>	--Output counter<br>	PRINT @counter<br>	-- Add 1 to counter every loop<br>	SET @counter= @counter+1<br>--End block of code to execute<br>END |

## Cursors
| Objective | Description | Syntax | Example |
|--------|------------|--------|----------------|
| DECLARE CURSOR | Cursors are created using the DECLARE statement. DECLARE names the cursor and takes a SELECT statement, complete with WHERE and other clauses if needed | see example >> | DECLARE CustCursor CURSOR<br>FOR<br>SELECT * FROM Customers<br>WHERE cust_email IS NULL |
| OPEN CURSOR | Cursors are opened using the OPEN CURSOR statement | see example >> | OPEN CURSOR CustCursor |
| FETCH | Cursor data can be accessed using the FETCH statement. FETCH specifies the rows to be retrieved, where they are to be retrieved from and where they are to be stored | see example >> | DECLARE @cust_id CHAR(10),<br>  @cust_name CHAR(50),<br>  @cust_address CHAR(50),<br>  @cust_city CHAR(50),<br>  @cust_state CHAR(5),<br>  @cust_zip CHAR(10),<br>  @cust_country CHAR(50),<br>  @cust_contact CHAR(50),<br>  @cust_email CHAR(255)<br>OPEN CustCursor<br>FETCH NEXT FROM CustCursor<br>  INTO @cust_id, @cust_name, @cust_address,<br>       @cust_city, @cust_state, @cust_zip,<br>       @cust_country, @cust_contact,<br>       @cust_email<br>  ...<br>WHILE @@FETCH_STATUS = 0<br>BEGIN<br>FETCH NEXT FROM CustCursor<br>       INTO @cust_id, @cust_name,<br>            @cust_address,@cust_city, <br>            @cust_state, @cust_zip,<br>            @cust_country, @cust_contact,<br>            @cust_email<br>END<br>CLOSE CustCursor |
| CLOSE CURSOR | The CLOSE statement is used to close cursors | see example >> | CLOSE CustCursor<br>DEALLOCATE CURSOR CustCursor |
| Cursor Example | In this example, we place a PRINT statement to print value in @order_num variable. All code must be executed at the same time. This example stores all values in the specified column in the variable @order_num (as specified in the SELECT statement) and then prints these values when executed | see example >> |
| Cursor Example | This example is like the previous one except it concatenates printed data and stores multiple variables | see example >> | USE AdventureWorks<br>GO<br>-- Declare the variables to store the values returned by FETCH.<br>DECLARE @LastName varchar(50), @FirstName varchar(50)<br>DECLARE contact_cursor CURSOR FOR<br>SELECT LastName, FirstName <br>FROM Contact<br>WHERE LastName LIKE 'B%'<br>ORDER BY LastName, FirstName<br><br>OPEN contact_cursor<br>-- Perform the first fetch and store the values in variables.<br>-- Note: The variables are in the same order as the columns<br>-- in the SELECT statement. <br>FETCH NEXT FROM contact_cursor<br>INTO @LastName, @FirstName<br><br>-- Check @@FETCH_STATUS to see if there are any more rows to fetch.<br>WHILE @@FETCH_STATUS = 0<br>BEGIN<br><br>   -- Concatenate and display the current values in the variables.<br>   PRINT 'Contact Name: ' + @FirstName + ' ' +  @LastName<br><br>   -- This is executed as long as the previous fetch succeeds.<br>   FETCH NEXT FROM contact_cursor<br>   INTO @LastName, @FirstName<br>END |
| Cursor Example |  | see example >> | -- Name: ordertotal<br>-- Parameters:        @order_num                = order number<br>--                        @taxable                = 0 if not taxable, 1 if taxable<br>--                        @order_total        = order total variable<br><br>ALTER PROCEDURE usp_ordertotal<br>        @order_num INT,<br>        @taxable BIT,<br>        @order_total Money OUTPUT<br>AS<br>BEGIN<br>        --Declare variable for total<br>        DECLARE @total Money;<br>        --Declare tax percentage<br>        DECLARE @taxrate INT;<br>        --Set tax rate <br>        SET @taxrate = 6;<br><br>        --Get the order total<br>        SELECT @total = SUM(item_price*quantity)<br>        FROM orderitems<br>        WHERE order_num = @order_num<br>        <br>        --Is this taxable?<br>        If @taxable = 1<br>           --Yes, so add taxrate to the total<br>                SET @total=@total+(@total/100*@taxrate);<br>        <br>        -- And finally, save to OUTPUT variable<br>        SELECT @order_total= @total;<br>END; |

## Constraints
| Objective | Description | Syntax | Example |
|--------|------------|--------|----------------|
| PRIMARY KEY | Creates table and defines a primary key | see example >> | CREATE TABLE Vendors<br>(  @vend_id CHAR(10) NOT NULL <span style="color:#0000ff;">PRIMARY KEY</span>,<br>   @vend_name CHAR(50) NOT NULL,<br>   @vend_address CHAR(50) NULL,<br>   @vend_city CHAR(50) NULL,<br>   @vend_state CHAR(5) NULL,<br>   @vend_zip CHAR(10) NULL,<br>   @vend_country CHAR(50) NULL<br>); |
| ADD CONSTRAINT PRIMARY KEY | Alters table and designates a column as the primary key; this syntax can be used in CREATE TABLE and ALTER TABLE statements | see example >> | ALTER TABLE Vendors<br><span style="color:#0000ff;">ADD CONSTRAINT PRIMARY KEY</span> <span style="color:#ff00ff;">(vend_id)</span>; |
| REFERENCES Table(foreign_key) | Creates table and defines a foreign key | see example >> | CREATE TABLE Orders<br>(  order_num INTEGER NOT NULL PRIMARY KEY,<br>   order_date DATETIME NOT NULL,<br>   <span style="color:#ff00ff;">cust_id CHAR(10) NOT NULL</span> <span style="color:#0000ff;">REFERENCES</span><span style="color:#ff00ff;"> Customers(cust_id)</span><br>); |
| ADD CONSTRAINT FOREIGN KEY | Alters table and designates a column as the foreign key | see example >> | ALTER TABLE Orders<br>ADD CONSTRAINT<br><span style="color:#ff00ff;">FOREIGN KEY (cust_id) </span><span style="color:#0000ff;">REFERENCES</span><span style="color:#ff00ff;"> Customers (cust_id)</span> |
| CHECK [constraint] | Checks every row to ensure that the column quantity > 0 using a CHECK [constraint] statement | see example >> | CREATE TABLE OrderItems<br>(  order_num INTEGER NOT NULL,<br>   order_item INTEGER NOT NULL,<br>   prod_id CHAR(10) NOT NULL,<br>   quantity INTEGER NOT NULL <span style="color:#ff00ff;">CHECK (quantity>0)</span>,<br>   item_price MONEY NULL<br>); |
| ADD CONSTRAINT CHECK | Checks every row in column 'gender' to validate that the value is LIKE '[MF]' | see example >> | ADD CONSTRAINT CHECK (gender LIKE '[MF]') |
| CREATE TRIGGER | Creates a trigger on the Customers table by setting cust_state to all uppercase on all INSERT and UPDATE operations | see example >> | CREATE TRIGGER customer_state<br>ON Customers<br>FOR INSERT, UPDATE<br>AS<br>UPDATE Customers<br>SET cust_state = Upper(cust_state)<br>WHERE Customers.cust_id = inserted.cust_id |
| CREATE TRIGGER: 'product added' | Simple trigger that displays 'product added' when a new row is inserted into the Products table | see example >> | CREATE TRIGGER trg_newproduct ON Products<br>FOR INSERT<br>AS<br>SELECT 'Product added'; |
| DISABLE TRIGGER | Disables a trigger | see example >> | --This code disables a trigger<br>DISABLE TRIGGER trg_newproduct on products |
| ENABLE TRIGGER | Enables a trigger | see example >> | --This code enables a trigger<br>ENABLE TRIGGER trg_newproduct on products |
| DROP TRIGGER | Drops a trigger | see example >> | --This code drops a trigger<br>DROP TRIGGER trg_newproduct; |
| CREATE TABLE FOR INSERT TRIGGER | Run this script before creating a trigger based on the tables referenced by the script | see example >> | DROP TRIGGER IF EXISTS trg_neworder2;<br>DROP TABLE IF EXISTS orders2;<br><br>--Make copy of Orders2<br>SELECT * INTO Orders2 from Orders;<br><br>--Create a new column (temporary)<br>ALTER TABLE orders2<br>DROP COLUMN order_num_tmp;<br><br>ALTER TABLE Orders2<br>ADD order_num_tmp Int Identity(1, 1);<br><br>ALTER TABLE<br>Orders2 DROP Column order_num;<br><br>Exec sp_rename 'Orders2.order_num_tmp', 'order_num', 'Column';<br>GO |
| CREATE TRIGGER FOR INSERT | Insert triggers are executed after an INSERT statement is executed. You can refer to virtual table named INSERTED inside the trigger code. <br><br>In the following example, we will return the value of the identity column in the orders table. Identity columns have a value automatically assigned. Here we create a trigger called trg_neworder on the orders table. When a new record is successfully inserted the trigger grabs the value from the identity column and stored it in the new variable we declared called @@IDENTITY. The select statement retrieves the value and displays it on the screen. | see example >> | Create TRIGGER trg_neworder2 on orders2<br>FOR INSERT<br>AS<br>SELECT @@IDENTITY AS order_num |
| [test the trigger] | -- | see example >> | -- test the trigger:<br>SET IDENTITY_INSERT orders2 ON;<br>INSERT INTO orders2<br>           (<br>           order_num,<br>           order_date<br>           ,cust_id)<br>     VALUES<br>           (10010,<br>                        '2/21/2008',<br>            1000000001) |
| CREATE TABLE FOR DELETED ENTRIES | Creates a table OrdersArchive so that the trigger below, when fired, inserts deleted entries from the Orders table into the OrdersArchive table | see example >> | CREATE TABLE OrdersArchive<br>(<br>  ordersarchive_ID int NOT NULL IDENTITY(1,1) Primary Key,<br>  order_num  INT,<br>  order_date DATETIME NOT NULL ,<br>  cust_id    INT      NOT NULL<br>); |
| CREATE TRIGGER AFTER DELETE THEN INSERT | Trigger that is triggered when a row is deleted from the Orders table; these rows are then inserted into the OrdersArchive table | see example >> | Create TRIGGER trg_deleteorderarchive2 on orders<br>AFTER DELETE<br>AS<br>BEGIN<br>        INSERT INTO OrdersArchive<br>                        (<br>                        order_num,<br>                        order_date,<br>                        cust_id<br>                        )<br>        Select <br>                        order_num,<br>                        order_date,<br>                        cust_id<br>        FROM DELETED<br>END |
| [test the trigger] | -- | see example >> | -- Allow manual inserts’ to identity <br>SET IDENTITY_INSERT orders2 ON;<br>INSERT INTO orders2<br>           (<br>           order_num,<br>           order_date<br>           ,cust_id)<br>     VALUES<br>           (10010,<br>            '2/21/2008',<br>            1000000001) |
| CREATE TRIGGER (UPDATE) | Trigger that is triggered when Vendors table is updated through an INSERT or UPDATE statement; changes the value of the country column to uppercase | see example >> | CREATE TRIGGER trg_vendors ON vendors<br>AFTER INSERT, UPDATE<br>AS<br>BEGIN<br>        UPDATE vendors<br>                SET vend_country=UPPER(vend_country)<br>        WHERE vend_id IN (SELECT vend_id FROM INSERTED);<br>END |
| [test the trigger] | -- | see example >> | -- test the trigger<br>UPDATE vendors<br>   SET vend_name = 'AnvilsRUs'     <br> WHERE vend_id = 'FNG01' |

## Indexes
| Objective | Description | Syntax | Example |
|--------|------------|--------|----------------|
| CREATE INDEX | Indexes are created with the CREATE INDEX statement; ON is used to specify the table being indexed (Products) and the columns to include in the index (prod_name) | see example >> | CREATE INDEX prod_name_index<br>ON Products (prod_name); |
| Creating a simple non-clustered index | Creates a nonclustered index on the cust_id column of the Orders table in the SQLClass database | see example >> | CREATE INDEX IX_Orders_cust_id <br>    ON Orders (cust_id); |
| Creating a simple nonclustered composite index | Creates a nonclustered composite index on the prod_name and prod_price columns of the Products table in the SQLClass database | see example >> | CREATE INDEX IX_Products_prodname_prodprice <br>    ON Products (prod_name, prod_price); |
| Creating a simple unique nonclustered index | Creates a nonclustered composite index on the vend_name column of the Vendors table in the SQLClass database | see example >> | CREATE UNIQUE INDEX AK_vendorName <br>    ON Vendors (vend_name); |